using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class DictionaryController : MonoBehaviour
{
    // Start is called before the first frame update
    void Awake()
    {
        RelatedDictionary aimal = new RelatedDictionary();
        aimal.InitDictionary("Animal", new List<string>() { "Уж",
"Ёж","Ёрш","Лев","Тур","Рак","Жук","Оса","Сыч","Тля","Гриф","Енот","Жаба","Змея","Киви","Краб","Лось","Моль","Овод","Орёл",
"Осёл","Рысь","Слон","Удав","Усач","Волк","Гага","Заяц","Ибис","Клещ","Лань","Муха","Ткач","Хрущ","Ящер","Бобр","Зубр",
"Крот","Лама","Мышь","Овца","Паук","Скат","Сова","Тигр","Бизон","Варан","Выдра","Дрофа","Жираф","Зебра","Кабан","Кобра",
"Крыса","Окунь","Судак","Хомяк","Шмель","Кулик","Акула","Баран","Ворон","Губка","Дятел","Козёл","Конёк","Лемур","Мамба",
"Осётр","Панда","Питон","Сойка","Тунец","Цапля","Шпрот","Щучка","Ягуар","Белка","Вобла","Дрозд","Комар","Кошка","Нанду",
"Норка","Олень","Полоз","Пчела","Сокол","Стриж","Сурок","Филин","Хорёк","Чайка","Анчоус","Барсук","Геккон","Гиббон","Иволга",
"Игуана","Кайман","Какаду","Кондор","Коршун","Косуля","Кролик","Муфлон","Страус","Суслик","Тюлень","Ястреб","Буйвол","Гадюка","Гарпия",
"Корова","Крылан","КуницаЛебедь","Летяга","Лисица","Сайгак","Синица","Собака","Тюлька","Улитка","Гадюка","Газель",
"Гепард","Голубь","Ехидна","Карась","Катран","Курица","Лошадь","Мурена","Мухоед","Павиан","Сорока","Кролик","Бегемот",
"Воробей","Журавль","Кукушка","Лангуст","Ленивец","Носорог","Саранча","Скворец","Утконос","Дельфин","Бабочка",
"Горилла","Дельфин","Кальмар","Кенгуру","Колибри","Лемминг","Леопард","Мангуст","Муравей","Опоссум","Пингвин",
"Полёвка","Попугай","Сверчок","Соловей","Верблюд","Глухарь","Горлица","Индейка","Косатка","Лягушка","Пеликан",
"Перепел","Слизень","Снегирь","Таракан","Тетерев","Устрица","Ящерица","Дикобраз","Древолаз","Антилопа","Долгопят",
"Стрекоза","Султанка","Веслоног","Крокодил","Листонос","Мартышка","Нетопырь","Обезьяна","Скорпион","Странник",
"Удильщик","Черепаха","Шишечник","Безглазка","Белозубка","Верблюдка","Водомерка","Звездочёт","Куропатка","Ленточник",
"Мухоловка","Пестрянка","Шелкопряд","Шипохвост","Барракуда","Блестянка","Вилохвост","Камышовка","Жаворонок","Зеленушка",
"Иглохвост","Каменушка","Крапивник","Ланцетник","Малиновка","Орангутан","Пеструшка","Пилильщик","Радужница",
"Щитоноска","Сардинелла","Белокровка","Броненосец","Двухвостка","Желтопузик","Каракатица","Моллюскоед","Веретеница",
"Вилохвостк","Древесница","Ленточница","Нектарница","Саламандра","Тростнянка","Трясогузка","Желтоглазка","Ложноглазка",
"Медоуказчик","Плоскохвост","Сколопендра","Трёхпёрстка","Широколобка","Щитомордник","Буревестник","Веерокрылка","Вислокрылка",
"Змееящерица","Пересмешник","Скрытохвост","Широконоска","Перепелятник","Веерохвостка"});


    }


}
